app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @category = Category.find(params[:id])

INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2013-06-13 20:52:26', 'TV', '2013-06-13 20:52:26')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def update
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 2
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy