app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`brand`, `created_at`, `description`, `name`, `price`, `serial`, `sub_category_id`, `updated_at`, `warranty_expire_at`) VALUES ('Sony', '2013-06-13 20:57:01', 'saya baru membeli sebuah TV. tv yang saya miliki memiliki ukuran 32 inc', 'TV baru', 12000.0, '1212333444', 1, '2013-06-13 20:57:01', '2013-06-13')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
  def update
    @product = Product.find(params[:id])