app/controllers/sub_categories_controller.rb

  def index
    @sub_categories = SubCategory.all
---
SELECT `sub_categories`.* FROM `sub_categories`

  def show
    @sub_category = SubCategory.find(params[:id])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 1 LIMIT 1

  def edit
    @sub_category = SubCategory.find(params[:id])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 2 LIMIT 1

  def create
    @sub_category = SubCategory.new(params[:sub_category])

    respond_to do |format|
      if @sub_category.save
---
INSERT INTO `sub_categories` (`category_id`, `created_at`, `name`, `updated_at`) VALUES (1, '2013-06-13 20:52:56', 'LED', '2013-06-13 20:52:56')

  def update
    @sub_category = SubCategory.find(params[:id])

    respond_to do |format|
      if @sub_category.update_attributes(params[:sub_category])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 4 LIMIT 1
UPDATE `sub_categories` SET `name` = 'LED', `updated_at` = '2013-06-14 05:28:06' WHERE `sub_categories`.`id` = 4

  def destroy
    @sub_category = SubCategory.find(params[:id])
    @sub_category.destroy
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`id` = 3 LIMIT 1
DELETE FROM `sub_categories` WHERE `sub_categories`.`id` = 3